app/Controllers/Admin/Loket.php

SELECT `loket`.*, `pelayanan`.`nama` as `nama_pelayanan`
FROM `loket`
JOIN `pelayanan` ON `loket`.`pelayanan_id`=`pelayanan`.`id`
ORDER BY `id` DESC
SELECT *
FROM `pelayanan`
ORDER BY `id` DESC
---
	public function index(){
		$data['title']      = "Loket";
		$data['validation'] = $this->validation;
		$data['loket']      = $this->loketProsesModel->select("loket.*, pelayanan.nama as nama_pelayanan")->JOIN('pelayanan', 'loket.pelayanan_id=pelayanan.id')->orderBy("id", "DESC")->get()->getResultArray();
		$data['pelayanan']	= $this->pelayananProsesModel->select('*')->orderBy('id', 'DESC')->get()->getResultArray();