app/Controllers/Admin/Panggil.php

	public function panggil($id){

		$detailLoket = $this->loketProsesModel->select("loket.*, a.nama as nama_pelayanan, a.kode")->join('pelayanan a', 'loket.pelayanan_id=a.id')->where('loket.id', $id)->get();
---
SELECT `loket`.*, `a`.`nama` as `nama_pelayanan`, `a`.`kode`
FROM `loket`
JOIN `pelayanan` `a` ON `loket`.`pelayanan_id`=`a`.`id`
WHERE `loket`.`id` = '4'