app/Controllers/Admin/PanggilProses.php

			if($cekLoketSibuk>0){
				echo json_encode(0);
			}else{
				$detailAntrian = $this->antrianProsesModel->select("*")->where('id', $id)->get()->getRowArray();
---
SELECT *
FROM `antrian`
WHERE `id` = '37'

						'loket_id'			=> $loketId,
					];

					$query = $this->antrianProsesModel->update($id, $dataUpdate);
---
UPDATE `antrian` SET `status` = 1, `waktu_panggil` = '2022-07-06 08:28:23', `loket_id` = '4'
WHERE `antrian`.`id` IN ('37')

				'waktu_selesai'	=> date("Y-m-d H:i:s"),
			];
			$kondisiUpdate = ['id'=>$getAntrianTerakhir['id']];
			$query = $this->antrianProsesModel->update($kondisiUpdate, $updateData);
---
UPDATE `antrian` SET `status` = 2, `waktu_selesai` = '2022-07-06 08:28:08'
WHERE `antrian`.`id` IN ('31')