app/Controllers/AntrianProses.php

SELECT *
FROM `antrian`
WHERE `pelayanan_id` = '2'
AND  `tanggal` LIKE '%2022-07-06%' ESCAPE '!'
ORDER BY `id` DESC
 LIMIT 1
---
	public function ambilAntrian(){
		$validation = [
			'id'		=> [
				'label'	=> 'ID',
				'rules'	=> 'required|is_not_unique[pelayanan.id]',
				'errors'=> [
					'required' => 'Kolom Wajib Diisi',
					'is_not_unique'	=> 'ID Tidak Tersedia',
				]
			],
		];

		if(!$this->validate($validation)){
			echo json_encode(0);
		}else{
			$id = $this->request->getPost('id');

			$antrianTerakhir = $this->antrianProsesModel->select('*')->where('pelayanan_id', $id)->like('tanggal', date('Y-m-d'))->orderBy('id', 'DESC')->limit(1)->get();

INSERT INTO `antrian` (`tanggal`, `no_antrian`, `status`, `waktu_panggil`, `waktu_selesai`, `pelayanan_id`, `loket_id`) VALUES ('2022-07-06 08:32:46', 1, 0, NULL, NULL, '2', NULL)
SELECT `kode`
FROM `pelayanan`
WHERE `id` = '2'
---
				'loket_id'			=> null,
			];

			$query = $this->antrianProsesModel->insert($dataDatabase);

			if($query){

				$detailPelayanan = $this->pelayananProsesModel->select('kode')->where('id', $id)->get()->getRowArray();